app/Models/PosyanduModel.php

    public function getPasien($call = false)
    {
        if ($call == false) {
            return $this->findAll();
        } else if ($call == true) {
            $builder = $this->db->table('pasien');
            $builder->join('riwayat', 'riwayat.id_pasien = pasien.id_pasien');
            $builder->where('call', $call);
            $query = $builder->get();
---
SELECT *
FROM `pasien`
JOIN `riwayat` ON `riwayat`.`id_pasien` = `pasien`.`id_pasien`
WHERE `call` = '1'

    public function getPasieni($id_pasien = false)
    {
        if ($id_pasien == false) {
            return $this->findAll();
        }

        return $this->where(['id_pasien' => $id_pasien])->first();
---
SELECT *
FROM `pasien`
WHERE `id_pasien` = '1'
 LIMIT 1