app/Models/RiwayatModel.php

    public function getPasieni($id_pasien = false)
    {
        if ($id_pasien == false) {
            return $this->findAll();
        }

        return $this->where(['id_pasien' => $id_pasien])->first();
---
SELECT *
FROM `riwayat`
WHERE `id_pasien` = '1'
 LIMIT 1